#+TITLE: Literate Emacs Config
#+AUTHOR: Jacob Brady
#+PROPERTY: header-args :tangle-mode
#+startup: overview

** Theme
#+begin_src emacs-lisp
;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;;(setq doom-theme 'doom-vibrant)
(use-package! doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t      ; if nil, bold is universally disabled
        doom-themes-enable-italic t)   ; if nil, italics is universally disabled
  ;; (load-theme 'doom-acario-light t)
  ;; (load-theme 'leuven t)
  ;; (load-theme 'doom-dark+ t)
  ;; (load-theme 'doom-solarized-light t)
  ;; (load-theme 'doom-one-light t)
  (load-theme 'doom-vibrant t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

#+RESULTS:
: #<font-spec nil nil DejaVu\ Serif nil nil light nil nil nil nil nil nil nil>

** RSS feeds

RSS feeds are updated using C-c C-x g and updated along with opening up the feed.org file with C-c C-x G

#+begin_src emacs-lisp

(setq org-feed-alist '(("InThePipeLine" "https://blogs.sciencemag.org/pipeline/feed"
"~/org/feeds.org" "In The Pipeline - Derek Lowe")

("eLife - Cancer Biology" "https://elifesciences.org/rss/subject/cancer-biology.xml"
"~/org/feeds.org" "eLife - Cancer Biology")

("Fierce Pharma" "https://www.fiercepharma.com/rss/xml" "~/org/feeds.org" "Fierce Pharma")
; ("The Motley Fool" "https://www.fool.com/feeds/index.aspx?id=foolwatch&format=rss2"
; "~/org/feeds.org" "The Motley Fool")

("Practical Fragments" "http://practicalfragments.blogspot.com/feeds/posts/default"
"~/org/feeds.org" "Practical Fragments")))

#+end_src

#+begin_src emacs-lisp
(setq elfeed-feeds
      '(("https://blogs.sciencemag.org/pipeline/feed" blog)
        ("http://practicalfragments.blogspot.com/feeds/posts/default" blog FBS)
        "https://elifesciences.org/rss/subject/cancer-biology.xml"
        "https://www.fiercepharma.com/rss/xml"
        "https://pubmed.ncbi.nlm.nih.gov/rss/journals/9110829/?limit=15&name=J%20Biomol%20NMR&utm_campaign=journals"
        "https://pubmed.ncbi.nlm.nih.gov/rss/search/1rgUKXhZzOOSeCofj8gdJK1nh4UEkQrpfCszfAT4Exq_f5woOu/?limit=15&utm_campaign=pubmed-2&fc=20210209213122"
        )
      )
#+end_src

#+RESULTS:
| (https://blogs.sciencemag.org/pipeline/feed blog) | http://practicalfragments.blogspot.com/feeds/posts/default | https://elifesciences.org/rss/subject/cancer-biology.xml | https://www.fiercepharma.com/rss/xml | https://pubmed.ncbi.nlm.nih.gov/rss/journals/9110829/?limit=15&name=J%20Biomol%20NMR&utm_campaign=journals | https://pubmed.ncbi.nlm.nih.gov/rss/search/1rgUKXhZzOOSeCofj8gdJK1nh4UEkQrpfCszfAT4Exq_f5woOu/?limit=15&utm_campaign=pubmed-2&fc=20210209213122 |

